simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
#include "calibration.h"
#include "calibration_tables.h"
#include "psoc_adc.h"
#include "filter_coeffs.h"
#include "FIR_adquisition.h"
#include "FIR_calibration.h"

/* El lote HW (PSOC_ADC_LOTE_SAMPLES, psoc_adc.h) debe equivaler exactamente
 * a una ventana de calibración GEO (CAL_AVG_N_GEO_*) — async_measure_service
 * trata cada lote como una ventana ya sumada. Si alguna vez divergen, mejor
 * fallar el build que misconvergir en silencio. */
#if (PSOC_ADC_LOTE_SAMPLES != CAL_AVG_N_GEO_PGA) || \
    (PSOC_ADC_LOTE_SAMPLES != CAL_AVG_N_GEO_BP) || \
    (PSOC_ADC_LOTE_SAMPLES != CAL_AVG_N_GEO_ADDER) || \
    (PSOC_ADC_LOTE_SAMPLES != CAL_AVG_N_GEO_LP)
#error "PSOC_ADC_LOTE_SAMPLES (psoc_adc.h) debe ser igual a CAL_AVG_N_GEO_* (calibration_tables_geo_*.h)"
#endif

/* Canal AMux_ADC del capacitor de filtrado (100nF a Vss, pin AMuxCapacitor en
 * TopDesign). AMux_ADC esta configurado en "All Modes" (AMux_ADC_ATMOSTONE=0,
 * ver AMux_ADC.h), es decir que el HARDWARE no impide tener varios canales
 * conectados a la vez -- la exclusion mutua entre canales de SEÑAL (0..3) la
 * tiene que garantizar el software. psoc_amux_select_exclusive() es el unico
 * punto de entrada que toca AMux_ADC_Connect/Disconnect para que esa garantia
 * viva en un solo lugar: nunca conecta un canal nuevo sin desconectar antes el
 * anterior, asi que dos canales 0..3 (señal real) jamas quedan en paralelo
 * (cortocircuito). El canal 4 (capacitor) se trackea aparte y se puede dejar
 * conectado en paralelo a cualquier canal de señal a propósito -- durante la
 * medición de una etapa de calibración ayuda a filtrar ruido chico; durante
 * captura/idle se desconecta para no cargar la señal en vivo con capacitancia
 * extra. */
#ifndef CAL_AMUX_CAP_CHANNEL
#define CAL_AMUX_CAP_CHANNEL 4u
#endif

static uint8 g_amux_active_channel = AMux_ADC_NULL_CHANNEL; /* uno de 0..3, o NULL */
static uint8 g_amux_cap_connected  = 0u;

static void psoc_amux_select_exclusive(uint8 channel, uint8 with_cap)
{
    if (g_amux_active_channel != AMux_ADC_NULL_CHANNEL &&
        g_amux_active_channel != channel) {
        AMux_ADC_Disconnect(g_amux_active_channel);
        g_amux_active_channel = AMux_ADC_NULL_CHANNEL;
    }
    if (g_amux_active_channel != channel) {
        AMux_ADC_Connect(channel);
        g_amux_active_channel = channel;
    }

    if (with_cap) {
        if (!g_amux_cap_connected) {
            AMux_ADC_Connect(CAL_AMUX_CAP_CHANNEL);
            g_amux_cap_connected = 1u;
        }
    } else if (g_amux_cap_connected) {
        AMux_ADC_Disconnect(CAL_AMUX_CAP_CHANNEL);
        g_amux_cap_connected = 0u;
    }
}

static void psoc_amux_start(void)
{
    AMux_ADC_Start();   /* desconecta TODO (0..4), estado inicial conocido */
    g_amux_active_channel = AMux_ADC_NULL_CHANNEL;
    g_amux_cap_connected = 0u;
}

#ifndef CAL_AMUX_ADC_START
#define CAL_AMUX_ADC_START() psoc_amux_start()
#endif

/* Selección de canal para operación normal/idle (canal de captura): sin
 * capacitor, exclusiva contra cualquier otro canal de señal. */
#ifndef CAL_AMUX_ADC_SELECT
#define CAL_AMUX_ADC_SELECT(channel) psoc_amux_select_exclusive((channel), 0u)
#endif

/* Selección de canal para MEDIR una etapa durante calibración: agrega el
 * capacitor de filtrado (canal 4) en paralelo al canal de la etapa, pedido
 * por el usuario para atenuar ruido chico durante la medición. */
#ifndef CAL_AMUX_ADC_SELECT_STAGE
#define CAL_AMUX_ADC_SELECT_STAGE(channel) psoc_amux_select_exclusive((channel), 1u)
#endif

static PsocCalDiagHook g_cal_diag_hook = (PsocCalDiagHook)0;

void psoc_calibration_set_diag_hook(PsocCalDiagHook hook)
{
    g_cal_diag_hook = hook;
}

static void cal_diag(uint8 event, uint8 value)
{
    if (g_cal_diag_hook != (PsocCalDiagHook)0) {
        g_cal_diag_hook(event, value);
    }
}

static void cal_diag_i16(uint8 event, int32 value)
{
    uint16 u;
    if (value > 32767L) { value = 32767L; }
    if (value < -32768L) { value = -32768L; }
    u = (uint16)(int16)value;
    cal_diag(event, (uint8)(u >> 8));
    cal_diag(event, (uint8)(u & 0xFFu));
}

/* Igual que cal_diag_i16 pero sin clamping: manda los 32 bits crudos de
 * "measured" (cum_avg interno) en 4 bytes MSB-first con el mismo evento.
 * cal_diag_i16 satura a +-32767 para la telemetria historica; ese clamping
 * hace que cualquier |measured|>32767 se vea identico (siempre 32767 o
 * -32768) y oculta si el mejor punto quedo "apenas" o "muy" fuera de
 * CAL_OPERATING_RANGE_COUNTS (ver HANDOFF_CALIBRATION.md). */
static void cal_diag_i32(uint8 event, int32 value)
{
    uint32 u = (uint32)value;
    cal_diag(event, (uint8)((u >> 24) & 0xFFu));
    cal_diag(event, (uint8)((u >> 16) & 0xFFu));
    cal_diag(event, (uint8)((u >> 8) & 0xFFu));
    cal_diag(event, (uint8)(u & 0xFFu));
}

#if 0 /* biseccion legacy -- unico consumidor era async_measure_service/
       * async_finish_stage, comentados mas abajo. */
static void cal_diag_point(uint8 dac, int32 measured)
{
    cal_diag(PSOC_EVT_CAL_STAGE_DAC, dac);
    cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, measured);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, measured);
}

static void cal_diag_realcheck_point(uint8 dac, int32 measured)
{
    cal_diag(PSOC_EVT_CAL_REALCHECK_DAC, dac);
    cal_diag_i32(PSOC_EVT_CAL_REALCHECK_MEAS32, measured);
}

static void cal_diag_measure_point(uint8 dac, int32 measured, uint8 realcheck)
{
    if (realcheck) {
        cal_diag_realcheck_point(dac, measured);
    } else {
        cal_diag_point(dac, measured);
    }
}
#endif /* #if 0 -- biseccion legacy */

static int32 abs_counts(int32 value)
{
    return (value < 0) ? -value : value;
}

#ifndef CAL_DIAG_SWEEP_ENABLE
#define CAL_DIAG_SWEEP_ENABLE 1u
#endif

#ifndef CAL_DIAG_SWEEP_SETTLE_MS
#define CAL_DIAG_SWEEP_SETTLE_MS 30u
#endif

static int32 cal_adc_read_direct_counts(void)
{
    int32 sample;

    ADC_StopConvert();
    ADC_StartConvert();
    (void)ADC_IsEndConversion(ADC_WAIT_FOR_RESULT);
    sample = ADC_GetResult32();
    ADC_StopConvert();

    return psoc_adc_counts_right_aligned(sample);
}

static int32 cal_adc_read_direct_avg_counts(uint8 sample_count)
{
    uint8 i;
    uint8 count = (sample_count == 0u) ? 1u : sample_count;
    int32 acc = 0L;

