simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    for (i = 0u; i < count; i++) {
        acc += cal_adc_read_direct_counts();
    }

    return acc / (int32)count;
}

static int32 cal_pi_compare_counts(int32 measured)
{
#if PSOC_HW_CLASS == PSOC_HW_HAMMER
    return abs_counts(measured);
#else
    return measured;
#endif
}

#if CAL_DIAG_SWEEP_ENABLE
static void cal_diag_sweep_stage(const PsocCalStage *stage)
{
    static const uint8 sweep_dac[3] = { 0u, 128u, 255u };
    uint8 i;

    for (i = 0u; i < 3u; i++) {
        stage->write(sweep_dac[i]);
        CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
        cal_diag(PSOC_EVT_CAL_SWEEP_DAC, sweep_dac[i]);
        cal_diag_i32(PSOC_EVT_CAL_SWEEP_MEAS32, cal_adc_read_direct_counts());
    }
}
#endif

/* ============================================================
 * BISECCION (legacy, comentada a pedido del usuario): GEO y HAMMER calibran
 * ahora exclusivamente vía el controlador PI (cal_pi_*, mas abajo). Todo lo
 * que sigue marcado "#if 0" es la biseccion vieja — se conserva como
 * referencia, no se borró, pero no compila. Ver calibration_tables.h,
 * bloque "Controlador PI de calibracion", para la ley de control activa.
 * ============================================================ */
#if 0
/* Reduce las cuentas crudas del ADC a una escala comparable con los codigos
 * del VDAC8. El ADC ve un span simplificado de 0..5V (signed +-2.5V alrededor
 * de VDDA/2), mientras el VDAC usa 0..4.080V; por eso al shift de 18->8 bits
 * se le aplica la correccion de spans 5000/4080. */
#define CAL_DAC_SCALE_SHIFT 10
#define CAL_ADC_SPAN_MV    5000L
#define CAL_VDAC_SPAN_MV   4080L

static int32 cal_div_round_signed(int32 value, int32 divisor)
{
    if (value >= 0L) {
        return (value + (divisor / 2L)) / divisor;
    }
    return -(((-value) + (divisor / 2L)) / divisor);
}

static int32 cal_scale_counts(int32 value)
{
    int32 shifted = value >> CAL_DAC_SCALE_SHIFT;
    return cal_div_round_signed(shifted * CAL_ADC_SPAN_MV, CAL_VDAC_SPAN_MV);
}

/* Ver CAL_OPERATING_RANGE_COUNTS (calibration_tables.h): +-0.5V absolutos.
 * Una medicion mas alla de esto deja al operacional fuera de rango
 * operativo, sin importar si "ok" hubiera dado 1. */
static uint8 cal_measured_out_of_range(int32 measured)
{
    return (abs_counts(cal_scale_counts(measured)) > cal_scale_counts(CAL_OPERATING_RANGE_COUNTS)) ? 1u : 0u;
}

static uint8 cal_stage_saturated(const PsocCalStage *stage, int32 measured)
{
    if (stage->sat_counts <= 0L) {
        return 0u;
    }
    return (abs_counts(cal_scale_counts(measured)) >= cal_scale_counts(stage->sat_counts)) ? 1u : 0u;
}
#endif /* #if 0 -- biseccion legacy */

static uint8 cal_stage_min_dac(const PsocCalStage *stage)
{
    return (stage->dac_center > stage->dac_max_change)
        ? (uint8)(stage->dac_center - stage->dac_max_change)
        : 0u;
}

static uint8 cal_stage_max_dac(const PsocCalStage *stage)
{
    uint16 max_dac = (uint16)stage->dac_center + (uint16)stage->dac_max_change;
    return (max_dac > 255u) ? 255u : (uint8)max_dac;
}

static uint8 cal_stage_clamp_dac(const PsocCalStage *stage, uint8 dac)
{
    uint8 lo = cal_stage_min_dac(stage);
    uint8 hi = cal_stage_max_dac(stage);
    if (dac < lo) { return lo; }
    if (dac > hi) { return hi; }
    return dac;
}

static uint8 cal_stage_center_dac(const PsocCalStage *stage)
{
    return cal_stage_clamp_dac(stage, stage->dac_center);
}

#if 0 /* biseccion legacy -- ver nota mas arriba */
static uint8 cal_stage_probe_dac(const PsocCalStage *stage)
{
    uint8 center = cal_stage_center_dac(stage);
    uint8 lo = cal_stage_min_dac(stage);
    uint8 hi = cal_stage_max_dac(stage);

    if (stage->direction >= 0) {
        if ((uint16)center + (uint16)stage->probe_step <= hi) {
            return (uint8)(center + stage->probe_step);
        }
        if (center > lo) {
            uint8 down = (center > stage->probe_step) ? (uint8)(center - stage->probe_step) : lo;
            return cal_stage_clamp_dac(stage, down);
        }
    } else {
        if (center > lo) {
            uint8 down = (center > stage->probe_step) ? (uint8)(center - stage->probe_step) : lo;
            return cal_stage_clamp_dac(stage, down);
        }
        if ((uint16)center + (uint16)stage->probe_step <= hi) {
            return (uint8)(center + stage->probe_step);
        }
    }

    return (center < hi) ? hi : lo;
}
#endif /* #if 0 -- biseccion legacy */

PsocCalResult g_psoc_cal_results[PSOC_CAL_MAX_STAGES];
uint8 g_psoc_cal_result_count = 0u;

#define CAL_ASYNC_EMPTY_POLL_LIMIT 2000000UL

/* Watchdog global: ticks de 10 ms. Debe quedar por debajo del timeout del ESP
 * para que CAL_DONE llegue antes de que el slave de por perdida la corrida. */
#ifndef CAL_WATCHDOG_TICKS
#define CAL_WATCHDOG_TICKS 40000UL
#endif

/* Periodo de telemetria de progreso (ticks de 10 ms => ~500 ms). */
#define CAL_PROGRESS_PERIOD_TICKS 50UL

/* Muestras del PI que se envian al ESP durante calibracion. No puede ser cada
 * muestra a 3 kHz: cada valor int32 viaja como 4 eventos UART. */
#ifndef CAL_PI_TELEM_PERIOD
#define CAL_PI_TELEM_PERIOD 16u
#endif

#ifndef CAL_PI_MAX_DAC_STEP
#define CAL_PI_MAX_DAC_STEP 1u
#endif

#ifndef CAL_PI_DIRECT_EMA_SHIFT
#define CAL_PI_DIRECT_EMA_SHIFT 3u
#endif

#ifndef CAL_PI_FINAL_VERIFY_SAMPLES
#define CAL_PI_FINAL_VERIFY_SAMPLES 16u
#endif

#ifndef CAL_PI_FINAL_VERIFY_SETTLE_MS
#define CAL_PI_FINAL_VERIFY_SETTLE_MS 30u
#endif

#ifndef CAL_PI_FINAL_REFINE_RADIUS
#define CAL_PI_FINAL_REFINE_RADIUS 16u
#endif

#ifndef CAL_PI_FINAL_REFINE_SAMPLES
#define CAL_PI_FINAL_REFINE_SAMPLES 4u
#endif

#ifndef CAL_PI_FINAL_REFINE_SETTLE_MS
#define CAL_PI_FINAL_REFINE_SETTLE_MS 5u
#endif

#ifndef CAL_PI_HAMMER_PASS_COUNT
#define CAL_PI_HAMMER_PASS_COUNT 3u
#endif

#if PSOC_HW_CLASS == PSOC_HW_HAMMER
#define CAL_PI_PASS_COUNT CAL_PI_HAMMER_PASS_COUNT
#else
#define CAL_PI_PASS_COUNT 1u
#endif

#ifndef CAL_DIAG_SWEEP_ENABLE
#define CAL_DIAG_SWEEP_ENABLE 1u
#endif

#ifndef CAL_DIAG_SWEEP_SETTLE_MS
#define CAL_DIAG_SWEEP_SETTLE_MS 30u
#endif

typedef enum {
    CAL_ASYNC_IDLE = 0u,
    CAL_ASYNC_STAGE_BEGIN,
    CAL_ASYNC_MEASURE,
    CAL_ASYNC_EVAL_INIT,
    CAL_ASYNC_EVAL_PROBE,
    CAL_ASYNC_PLAN_ITER,
    CAL_ASYNC_EVAL_ITER,
    CAL_ASYNC_VERIFY_BEGIN,
    CAL_ASYNC_EVAL_VERIFY,
    CAL_ASYNC_REALCHECK_SWITCH,
    CAL_ASYNC_REALCHECK_BEGIN,
    CAL_ASYNC_EVAL_REALCHECK,
    CAL_ASYNC_DONE
} PsocCalAsyncState;

