simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
typedef struct {
    PsocCalAsyncState state;
    PsocCalAsyncState after_measure;
    uint8 busy;
    uint8 done;
    uint8 ok;
    uint8 stage_index;
    uint8 pass_index;
    uint8 dac;
    uint8 lo;
    uint8 hi;
    uint8 increasing;
    uint16 iter;
    uint8 best_dac;
    int32 measured;
    int32 base_measured;
    int32 best_measured;
    int32 best_abs_error;
    uint8 best_saturated;
    uint8 saturated_seen;
    uint8 non_saturated_seen;
    uint8 candidate_count;
    uint8 candidate_dac[CAL_BEST_CANDIDATE_COUNT];
    int32 candidate_measured[CAL_BEST_CANDIDATE_COUNT];
    int32 candidate_abs_error[CAL_BEST_CANDIDATE_COUNT];
    uint8 candidate_saturated[CAL_BEST_CANDIDATE_COUNT];
    uint8 visited_count;
    uint8 visited_pos;
    uint8 visited_dac[CAL_VISIT_HISTORY_COUNT];
    uint8 slope_known[PSOC_CAL_MAX_STAGES];
    uint8 slope_increasing[PSOC_CAL_MAX_STAGES];
    int32 acc;
    const PsocCalAvgCfg *avg_cfg;
    int32 window_buf[CAL_AVG_WINDOW_MAX];
    int32 window_sum;
    int32 prev_avg;
    uint16 avg_count;
    uint16 discard_count;
    uint16 total_samples;
    uint8 window_pos;
    uint8 window_filled_count;
    uint8 stable_streak_count;
    uint8 have_prev_avg;
    uint8 realcheck_diag;
    uint8 realcheck_candidate_active;
    uint8 realcheck_nudge_count;
    uint8 realcheck_current_dac;
    int32 realcheck_current_measured;
    int32 realcheck_current_abs_error;
    uint8 realcheck_current_saturated;
    int8 realcheck_last_nudge;
    uint32 empty_polls;
    uint32 start_ticks;
    uint32 last_progress_ticks;
} PsocCalAsync;

static PsocCalAsync g_cal_async = { CAL_ASYNC_IDLE };

#if 0 /* biseccion legacy -- ver nota junto a cal_stage_saturated mas arriba */
static void cal_async_reset_stage_memory(void)
{
    uint8 i;
    g_cal_async.best_dac = 0u;
    g_cal_async.best_measured = 0L;
    g_cal_async.best_abs_error = 0x7FFFFFFFL;
    g_cal_async.best_saturated = 1u;
    g_cal_async.saturated_seen = 0u;
    g_cal_async.non_saturated_seen = 0u;
    g_cal_async.candidate_count = 0u;
    g_cal_async.visited_count = 0u;
    g_cal_async.visited_pos = 0u;
    for (i = 0u; i < CAL_BEST_CANDIDATE_COUNT; i++) {
        g_cal_async.candidate_dac[i] = 0u;
        g_cal_async.candidate_measured[i] = 0L;
        g_cal_async.candidate_abs_error[i] = 0x7FFFFFFFL;
        g_cal_async.candidate_saturated[i] = 1u;
    }
    for (i = 0u; i < CAL_VISIT_HISTORY_COUNT; i++) {
        g_cal_async.visited_dac[i] = 0u;
    }
}

static uint8 cal_async_seen_dac(uint8 dac)
{
    uint8 i;
    for (i = 0u; i < g_cal_async.visited_count; i++) {
        if (g_cal_async.visited_dac[i] == dac) {
            return 1u;
        }
    }
    return 0u;
}

static void cal_async_remember_dac(uint8 dac)
{
    if (g_cal_async.visited_count < CAL_VISIT_HISTORY_COUNT) {
        g_cal_async.visited_dac[g_cal_async.visited_count] = dac;
        g_cal_async.visited_count++;
        return;
    }
    g_cal_async.visited_dac[g_cal_async.visited_pos] = dac;
    g_cal_async.visited_pos =
        (uint8)((g_cal_async.visited_pos + 1u) % CAL_VISIT_HISTORY_COUNT);
}

static void cal_async_update_best(uint8 dac, int32 measured, int32 abs_error,
                                  uint8 saturated)
{
    if (saturated) {
        g_cal_async.saturated_seen = 1u;
        if (!g_cal_async.non_saturated_seen &&
            (g_cal_async.best_saturated ||
             abs_error < g_cal_async.best_abs_error)) {
            g_cal_async.best_abs_error = abs_error;
            g_cal_async.best_dac = dac;
            g_cal_async.best_measured = measured;
            g_cal_async.best_saturated = 1u;
        }
        return;
    }

    g_cal_async.non_saturated_seen = 1u;
    if (g_cal_async.best_saturated ||
        abs_error < g_cal_async.best_abs_error) {
        g_cal_async.best_abs_error = abs_error;
        g_cal_async.best_dac = dac;
        g_cal_async.best_measured = measured;
        g_cal_async.best_saturated = 0u;
    }
}

static void cal_async_store_candidate(uint8 dac, int32 measured, int32 abs_error,
                                      uint8 saturated)
{
    uint8 i;
    uint8 worst_i = 0u;
    int32 worst_score = -1L;

    cal_async_update_best(dac, measured, abs_error, saturated);

    for (i = 0u; i < g_cal_async.candidate_count; i++) {
        if (g_cal_async.candidate_dac[i] == dac) {
            if ((!saturated && g_cal_async.candidate_saturated[i]) ||
                (saturated == g_cal_async.candidate_saturated[i] &&
                 abs_error < g_cal_async.candidate_abs_error[i])) {
                g_cal_async.candidate_measured[i] = measured;
                g_cal_async.candidate_abs_error[i] = abs_error;
                g_cal_async.candidate_saturated[i] = saturated;
            }
            return;
        }
    }

    if (g_cal_async.candidate_count < CAL_BEST_CANDIDATE_COUNT) {
        i = g_cal_async.candidate_count;
        g_cal_async.candidate_count++;
        g_cal_async.candidate_dac[i] = dac;
        g_cal_async.candidate_measured[i] = measured;
        g_cal_async.candidate_abs_error[i] = abs_error;
        g_cal_async.candidate_saturated[i] = saturated;
        return;
    }

    for (i = 0u; i < CAL_BEST_CANDIDATE_COUNT; i++) {
        int32 score = g_cal_async.candidate_abs_error[i];
        if (g_cal_async.candidate_saturated[i]) {
            score += 0x10000000L;
        }
        if (score > worst_score) {
            worst_score = score;
            worst_i = i;
        }
    }

    {
        int32 new_score = abs_error;
        if (saturated) {
            new_score += 0x10000000L;
        }
        if (new_score < worst_score) {
            g_cal_async.candidate_dac[worst_i] = dac;
            g_cal_async.candidate_measured[worst_i] = measured;
            g_cal_async.candidate_abs_error[worst_i] = abs_error;
            g_cal_async.candidate_saturated[worst_i] = saturated;
        }
    }
}

static uint8 cal_async_record_measurement(const PsocCalStage *stage)
{
    int32 abs_error = abs_counts(cal_scale_counts(stage->target_counts) -
                                  cal_scale_counts(g_cal_async.measured));
    uint8 seen = cal_async_seen_dac(g_cal_async.dac);
    uint8 saturated = cal_stage_saturated(stage, g_cal_async.measured);

    cal_diag(PSOC_EVT_CAL_STAGE_SAT, saturated);
    cal_async_store_candidate(g_cal_async.dac, g_cal_async.measured,
                              abs_error, saturated);
    if (!seen) {
        cal_async_remember_dac(g_cal_async.dac);
    }
    return seen;
}
#endif /* #if 0 -- biseccion legacy */

#if 0 /* servo lento legacy -- comentado a pedido del usuario, ver
       * stubs no-op de psoc_calibration_servo_* mas abajo */
typedef enum {
    CAL_SERVO_IDLE = 0u,
    CAL_SERVO_MEASURE
} PsocCalServoState;

