simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
typedef struct {
    uint8 enabled;
    PsocCalServoState state;
    uint8 stage_index;
    uint8 dac;
    int32 acc;
    int32 cum_sum;
    int32 cum_count;
    int32 prev_avg;
    uint16 avg_count;
    uint16 discard_count;
    uint8 settle_windows;
    uint8 have_prev_avg;
    uint32 empty_polls;
    uint32 next_due_ticks;

    uint8 have_last[PSOC_CAL_MAX_STAGES];
    uint8 last_dac[PSOC_CAL_MAX_STAGES];
    int32 last_measured[PSOC_CAL_MAX_STAGES];
    uint8 have_slope[PSOC_CAL_MAX_STAGES];
    uint8 increasing[PSOC_CAL_MAX_STAGES];
    uint8 trial_active[PSOC_CAL_MAX_STAGES];
    uint8 prev_dac[PSOC_CAL_MAX_STAGES];
    int32 prev_abs_error[PSOC_CAL_MAX_STAGES];
    int8 last_dir[PSOC_CAL_MAX_STAGES];
    int32 integral[PSOC_CAL_MAX_STAGES];
} PsocCalServo;

typedef struct {
    int32 kp_num;
    int32 ki_num;
    int32 ki_div;
    int32 deadband_counts;
    uint8 fine_step;
    uint8 recovery_step;
} PsocCalServoTune;

static PsocCalServo g_cal_servo = { CAL_SERVO_ENABLE_DEFAULT };

static const PsocCalServoTune g_cal_servo_tune[PSOC_CAL_STAGE_COUNT] = {
#if PSOC_HW_CLASS == PSOC_HW_GEO
    { CAL_SERVO_KP_NUM_GEO_PGA,   CAL_SERVO_KI_NUM_GEO_PGA,   CAL_SERVO_KI_DIV_GEO_PGA,   CAL_SERVO_DEADBAND_GEO_PGA,   CAL_SERVO_FINE_STEP_GEO_PGA,   CAL_SERVO_RECOVERY_STEP_GEO_PGA },
#if defined(VDAC_ref_BP_DEFAULT_DATA) || defined(CY_DVDAC_VDAC_ref_BP_H)
    { CAL_SERVO_KP_NUM_GEO_BP,    CAL_SERVO_KI_NUM_GEO_BP,    CAL_SERVO_KI_DIV_GEO_BP,    CAL_SERVO_DEADBAND_GEO_BP,    CAL_SERVO_FINE_STEP_GEO_BP,    CAL_SERVO_RECOVERY_STEP_GEO_BP },
#endif
    { CAL_SERVO_KP_NUM_GEO_ADDER, CAL_SERVO_KI_NUM_GEO_ADDER, CAL_SERVO_KI_DIV_GEO_ADDER, CAL_SERVO_DEADBAND_GEO_ADDER, CAL_SERVO_FINE_STEP_GEO_ADDER, CAL_SERVO_RECOVERY_STEP_GEO_ADDER },
    { CAL_SERVO_KP_NUM_GEO_LP,    CAL_SERVO_KI_NUM_GEO_LP,    CAL_SERVO_KI_DIV_GEO_LP,    CAL_SERVO_DEADBAND_GEO_LP,    CAL_SERVO_FINE_STEP_GEO_LP,    CAL_SERVO_RECOVERY_STEP_GEO_LP },
#else
    { CAL_SERVO_KP_NUM_HAMMER_PGA, CAL_SERVO_KI_NUM_HAMMER_PGA, CAL_SERVO_KI_DIV_HAMMER_PGA, CAL_SERVO_DEADBAND_HAMMER_PGA, CAL_SERVO_FINE_STEP_HAMMER_PGA, CAL_SERVO_RECOVERY_STEP_HAMMER_PGA },
    { CAL_SERVO_KP_NUM_HAMMER_LP,  CAL_SERVO_KI_NUM_HAMMER_LP,  CAL_SERVO_KI_DIV_HAMMER_LP,  CAL_SERVO_DEADBAND_HAMMER_LP,  CAL_SERVO_FINE_STEP_HAMMER_LP,  CAL_SERVO_RECOVERY_STEP_HAMMER_LP },
#endif
};
#endif /* #if 0 -- servo lento legacy */

/* Compartido con cal_pi_run_service (anti-windup del PI de calibracion) a
 * pesar del nombre "servo" -- no se movio/renombro para no aumentar el
 * diff, pero NO es parte del servo lento comentado arriba. */
static int32 cal_servo_clip_integral(int32 value)
{
    if (value > CAL_SERVO_INTEGRAL_LIMIT) { return CAL_SERVO_INTEGRAL_LIMIT; }
    if (value < -CAL_SERVO_INTEGRAL_LIMIT) { return -CAL_SERVO_INTEGRAL_LIMIT; }
    return value;
}

#if 0 /* servo lento legacy -- ver nota junto a CAL_SERVO_IDLE mas arriba */
static uint16 cal_servo_settle_samples(uint8 stage_index)
{
#if PSOC_HW_CLASS == PSOC_HW_GEO
    switch (stage_index) {
        case 0u: return CAL_SERVO_SETTLE_SAMPLES_GEO_PGA;
#if defined(VDAC_ref_BP_DEFAULT_DATA) || defined(CY_DVDAC_VDAC_ref_BP_H)
        case 1u: return CAL_SERVO_SETTLE_SAMPLES_GEO_BP;
        case 2u: return CAL_SERVO_SETTLE_SAMPLES_GEO_ADDER;
#else
        case 1u: return CAL_SERVO_SETTLE_SAMPLES_GEO_ADDER;
#endif
        default: return CAL_SERVO_SETTLE_SAMPLES_GEO_LP;
    }
#else
    switch (stage_index) {
        case 0u: return CAL_SERVO_SETTLE_SAMPLES_HAMMER_PGA;
        default: return CAL_SERVO_SETTLE_SAMPLES_HAMMER_LP;
    }
#endif
}
#endif /* #if 0 -- servo lento legacy */

static uint8 cal_stage_current_dac(uint8 stage_index)
{
    if (stage_index >= g_psoc_cal_result_count) {
        return cal_stage_center_dac(&g_psoc_cal_stages[stage_index]);
    }
    return cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index],
                               g_psoc_cal_results[stage_index].final_dac);
}

static void cal_stage_write_result(uint8 stage_index, uint8 dac)
{
    if (stage_index < PSOC_CAL_STAGE_COUNT) {
        uint8 clamped = cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index], dac);
        g_psoc_cal_stages[stage_index].write(clamped);
        g_psoc_cal_results[stage_index].final_dac = clamped;
        if (g_psoc_cal_result_count < PSOC_CAL_STAGE_COUNT) {
            g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
        }
    }
}

uint8 psoc_calibration_stage_count(void)
{
    return PSOC_CAL_STAGE_COUNT;
}

void psoc_calibration_seed_dac(const uint8 *dac_values, uint8 count)
{
    uint8 i;
    for (i = 0u; i < count && i < PSOC_CAL_STAGE_COUNT; i++) {
        cal_stage_write_result(i, dac_values[i]);
    }
}

void psoc_calibration_report_adc_snapshot(void)
{
    uint8 i;

    cal_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        const PsocCalStage *stage = &g_psoc_cal_stages[i];
        uint8 saved_dac = cal_stage_current_dac(i);

        ADC_Stop();
        CAL_AMUX_ADC_SELECT(stage->adc_channel);
        ADC_Start();

        stage->write(saved_dac);
        CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
        cal_diag(PSOC_EVT_ADC_SNAPSHOT_BEGIN, i);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_TARGET32, stage->target_counts);
        cal_diag(PSOC_EVT_CAL_STAGE_DAC, saved_dac);
        cal_diag_i32(PSOC_EVT_ADC_RAW32, cal_adc_read_direct_counts());

#if CAL_DIAG_SWEEP_ENABLE
        cal_diag_sweep_stage(stage);
        stage->write(saved_dac);
        CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
        cal_diag(PSOC_EVT_CAL_STAGE_DAC, saved_dac);
        cal_diag_i32(PSOC_EVT_ADC_RAW32, cal_adc_read_direct_counts());
#endif
    }

    psoc_calibration_restore_capture_path();
}

#if 0 /* servo lento legacy -- ver nota junto a CAL_SERVO_IDLE mas arriba.
       * psoc_calibration_servo_enable/enabled/abort/service (API publica,
       * llamada desde main.c) tienen stubs no-op mas abajo; sus cuerpos
       * reales (que usaban estas funciones) tambien quedaron comentados,
       * ver el segundo bloque "#if 0 -- servo lento legacy". */
static uint8 cal_servo_apply_measurement(uint8 stage_index, uint8 dac, int32 measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];
    const PsocCalServoTune *tune = &g_cal_servo_tune[stage_index];
    PsocCalResult *result = &g_psoc_cal_results[stage_index];
    int32 error = stage->target_counts - measured;
    int32 abs_error = abs_counts(error);
    int8 dir;
    uint8 step;
    int16 next;
    uint8 slope_increasing;

