simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    g_cal_servo.prev_avg = cum_avg;
    g_cal_servo.have_prev_avg = 1u;
    g_cal_servo.settle_windows++;
    if (g_cal_servo.settle_windows >= CAL_SERVO_SETTLE_MAX_WINDOWS) {
        uint8 locked;
        cal_diag(PSOC_EVT_CAL_STAGE_DAC, g_cal_servo.dac);
        cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, cum_avg);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, cum_avg);
        locked = cal_servo_apply_measurement(stage_index, g_cal_servo.dac, cum_avg);
        psoc_calibration_restore_capture_path();
        if (locked) {
            g_cal_servo.stage_index = (uint8)((stage_index + 1u) % PSOC_CAL_STAGE_COUNT);
        }
        g_cal_servo.next_due_ticks = psoc_now_ticks() + CAL_SERVO_PERIOD_TICKS;
        g_cal_servo.state = CAL_SERVO_IDLE;
        return 1u;
    }

    return 0u;
}
#endif /* #if 0 -- servo lento legacy */

void psoc_calibration_start_references(void)
{
    uint8 i;

    CAL_AMUX_ADC_START();
    ADC_Stop();
    CAL_AMUX_ADC_SELECT(CAL_ADC_CAPTURE_CHANNEL);
    ADC_Start();
    ADC_StopConvert();

#if PSOC_HW_CLASS == PSOC_HW_GEO
    VDAC_ref_PGA_Start();
#if defined(VDAC_ref_BP_DEFAULT_DATA) || defined(CY_DVDAC_VDAC_ref_BP_H)
    VDAC_ref_BP_Start();
#endif
    VDAC_Ref_Adder_Start();
    VDAC_ref_LP_Start();
#else
    VDAC_PGA_Start();
    VDAC_LP_Start();
#endif

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        uint8 center = cal_stage_center_dac(&g_psoc_cal_stages[i]);
        g_psoc_cal_stages[i].write(center);
        g_psoc_cal_results[i].final_dac = center;
        g_psoc_cal_results[i].final_measured = 0L;
        g_psoc_cal_results[i].ok = 1u;
    }
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
}

/* Deja el AMux_ADC en el canal de captura (GEO_LP): este es el estado IDLE,
 * en el que el ADC queda mirando GEO_LP para poder verificar en cualquier
 * momento si el front-end sigue calibrado. */
void psoc_calibration_restore_capture_path(void)
{
    ADC_Stop();
    CAL_AMUX_ADC_SELECT(CAL_ADC_CAPTURE_CHANNEL);
    ADC_Start();
    ADC_StopConvert();
}

void psoc_calibration_reset_references(void)
{
    uint8 i;

    ADC_Stop();
    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        uint8 center = cal_stage_center_dac(&g_psoc_cal_stages[i]);
        g_psoc_cal_stages[i].write(center);
        g_psoc_cal_results[i].final_dac = center;
        g_psoc_cal_results[i].final_measured = 0L;
        g_psoc_cal_results[i].ok = 1u;
    }
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
    psoc_calibration_restore_capture_path();
}

#if 0 /* servo lento legacy -- comentado a pedido del usuario (calibracion
       * pasa a ser PI-only, ver bloque "Controlador PI de calibracion" mas
       * abajo). Stubs no-op de la API publica justo despues de este bloque. */
void psoc_calibration_servo_enable(uint8 enable)
{
    g_cal_servo.enabled = enable ? 1u : 0u;
    if (!g_cal_servo.enabled) {
        psoc_calibration_servo_abort();
    } else {
        g_cal_servo.next_due_ticks = psoc_now_ticks();
    }
}

uint8 psoc_calibration_servo_enabled(void)
{
    return g_cal_servo.enabled;
}

void psoc_calibration_servo_abort(void)
{
    if (g_cal_servo.state == CAL_SERVO_MEASURE) {
        ADC_StopConvert();
        psoc_calibration_restore_capture_path();
    }
    g_cal_servo.state = CAL_SERVO_IDLE;
    g_cal_servo.next_due_ticks = psoc_now_ticks() + CAL_SERVO_PERIOD_TICKS;
}

uint8 psoc_calibration_servo_service(void)
{
    if (!g_cal_servo.enabled || g_cal_async.busy) {
        return 0u;
    }

    if (g_cal_servo.state == CAL_SERVO_IDLE) {
        uint32 now = psoc_now_ticks();
        if ((int32)(now - g_cal_servo.next_due_ticks) >= 0) {
            cal_servo_measure_begin(g_cal_servo.stage_index);
        }
        return 0u;
    }

    return cal_servo_measure_service();
}
#endif /* #if 0 -- servo lento legacy */

/* Stubs no-op: el servo lento de mantenimiento esta comentado (arriba) a
 * pedido del usuario -- calibracion es 100% PI ahora. Se mantiene la firma
 * publica porque main.c los llama incondicionalmente. */
void psoc_calibration_servo_enable(uint8 enable)
{
    (void)enable;
}

uint8 psoc_calibration_servo_enabled(void)
{
    return 0u;
}

void psoc_calibration_servo_abort(void)
{
}

uint8 psoc_calibration_servo_service(void)
{
    return 0u;
}

#if 0 /* biseccion legacy -- ver nota junto a cal_stage_saturated mas arriba */
static uint8 cal_avg_cfg_avg_n(const PsocCalAvgCfg *cfg)
{
    return (cfg->avg_n == 0u) ? 1u : cfg->avg_n;
}

static uint8 cal_avg_cfg_window_count(const PsocCalAvgCfg *cfg)
{
    if (cfg->window_count == 0u) {
        return 1u;
    }
    if (cfg->window_count > CAL_AVG_WINDOW_MAX) {
        return CAL_AVG_WINDOW_MAX;
    }
    return cfg->window_count;
}

static uint16 cal_avg_cfg_max_samples(const PsocCalAvgCfg *cfg)
{
    uint16 floor_samples =
        (uint16)((uint16)cal_avg_cfg_avg_n(cfg) *
                 (uint16)cal_avg_cfg_window_count(cfg));
    if (cfg->max_samples < floor_samples) {
        return floor_samples;
    }
    return cfg->max_samples;
}

static uint8 cal_avg_cfg_stable_streak(const PsocCalAvgCfg *cfg)
{
    return (cfg->stable_streak == 0u) ? 1u : cfg->stable_streak;
}

static void async_measure_begin(uint8 dac, PsocCalAsyncState after_measure,
                                const PsocCalAvgCfg *avg_cfg,
                                uint16 discard_samples, uint8 write_dac,
                                uint8 realcheck_diag)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    uint8 i;

    g_cal_async.dac = dac;
    g_cal_async.after_measure = after_measure;
    g_cal_async.avg_cfg = avg_cfg;
    g_cal_async.acc = 0L;
    g_cal_async.window_sum = 0L;
    g_cal_async.avg_count = 0u;
    /* discard_samples llega en unidades de muestra cruda; el lote HW entrega
     * ventanas completas, así que se convierte a lotes-a-descartar con
     * redondeo hacia arriba (nunca menos descarte que antes). */
    g_cal_async.discard_count = (uint16)((discard_samples + (PSOC_ADC_LOTE_SAMPLES - 1u)) /
                                          PSOC_ADC_LOTE_SAMPLES);
    g_cal_async.total_samples = 0u;
    g_cal_async.window_pos = 0u;
    g_cal_async.window_filled_count = 0u;
    g_cal_async.stable_streak_count = 0u;
    g_cal_async.have_prev_avg = 0u;
    g_cal_async.prev_avg = 0L;
    g_cal_async.empty_polls = 0UL;
    g_cal_async.realcheck_diag = realcheck_diag;
    for (i = 0u; i < CAL_AVG_WINDOW_MAX; i++) {
        g_cal_async.window_buf[i] = 0L;
    }
    if (write_dac) {
        stage->write(dac);
    }
    psoc_adc_clear_isr_window();
    g_cal_async.state = CAL_ASYNC_MEASURE;
}

/* Mide con una ventana deslizante de peso constante: cada ventana de avg_n
 * muestras entra a un buffer circular de window_count sumas. El promedio se
 * calcula sobre las ultimas avg_n*window_count muestras; solo se considera
 * estable cuando ese promedio varia poco durante stable_streak comparaciones
 * consecutivas, con el buffer ya lleno. */
static uint8 async_measure_service(void)
{
    int32 win_sum;
    uint8 win_n;
    int32 sliding_avg;
    const PsocCalAvgCfg *cfg = g_cal_async.avg_cfg;
    uint8 avg_n = cal_avg_cfg_avg_n(cfg);
    uint8 window_count = cal_avg_cfg_window_count(cfg);
    uint16 max_samples = cal_avg_cfg_max_samples(cfg);

    if (!psoc_adc_take_isr_window(&win_sum, &win_n)) {
        g_cal_async.empty_polls++;
        if (g_cal_async.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            g_cal_async.measured = 0x7FFFL;
            cal_diag_measure_point(g_cal_async.dac, g_cal_async.measured,
                                   g_cal_async.realcheck_diag);
            g_cal_async.state = g_cal_async.after_measure;
            return 1u;
        }
        return 0u;
    }

    g_cal_async.empty_polls = 0UL;
    if (g_cal_async.discard_count > 0u) {
        g_cal_async.discard_count--;
        return 0u;
    }

