simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    /* win_n solo puede valer PSOC_ADC_LOTE_SAMPLES (garantizado por el
     * #error de arriba == avg_n en todo build posible); se ignora a
     * propósito en vez de ramificar de forma defensiva sin salida sensata. */
    (void)win_n;
    g_cal_async.acc = win_sum;
    g_cal_async.avg_count = avg_n;

    if (g_cal_async.avg_count < avg_n) {
        return 0u;
    }

    if (g_cal_async.window_filled_count < window_count) {
        g_cal_async.window_buf[g_cal_async.window_pos] = g_cal_async.acc;
        g_cal_async.window_sum += g_cal_async.acc;
        g_cal_async.window_filled_count++;
    } else {
        g_cal_async.window_sum -= g_cal_async.window_buf[g_cal_async.window_pos];
        g_cal_async.window_buf[g_cal_async.window_pos] = g_cal_async.acc;
        g_cal_async.window_sum += g_cal_async.acc;
    }
    g_cal_async.window_pos++;
    if (g_cal_async.window_pos >= window_count) {
        g_cal_async.window_pos = 0u;
    }
    g_cal_async.total_samples =
        (uint16)(g_cal_async.total_samples + (uint16)avg_n);
    g_cal_async.acc = 0L;
    g_cal_async.avg_count = 0u;

    sliding_avg = g_cal_async.window_sum /
        ((int32)avg_n * (int32)g_cal_async.window_filled_count);
    g_cal_async.measured = sliding_avg;

    if (g_cal_async.window_filled_count >= window_count) {
        if (g_cal_async.have_prev_avg &&
            abs_counts(sliding_avg - g_cal_async.prev_avg) <=
                cfg->settle_tol_counts) {
            g_cal_async.stable_streak_count++;
        } else {
            g_cal_async.stable_streak_count = 0u;
        }

        if (g_cal_async.stable_streak_count >=
            cal_avg_cfg_stable_streak(cfg)) {
            cal_diag_measure_point(g_cal_async.dac, g_cal_async.measured,
                                   g_cal_async.realcheck_diag);
            g_cal_async.state = g_cal_async.after_measure;
            return 1u;
        }

        g_cal_async.prev_avg = sliding_avg;
        g_cal_async.have_prev_avg = 1u;
    }

    if (g_cal_async.total_samples >= max_samples) {
        cal_diag_measure_point(g_cal_async.dac, g_cal_async.measured,
                               g_cal_async.realcheck_diag);
        g_cal_async.state = g_cal_async.after_measure;
        return 1u;
    }

    return 0u;
}

static void async_finish_stage(uint8 ok)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    PsocCalResult *result = &g_psoc_cal_results[g_cal_async.stage_index];
    uint8 final_dac = g_cal_async.best_dac;
    int32 final_measured = g_cal_async.best_measured;

    if (g_cal_async.best_abs_error <= cal_scale_counts(stage->tolerance_counts)) {
        ok = 1u;
    }

    if (g_cal_async.best_saturated && !g_cal_async.non_saturated_seen &&
        g_cal_async.saturated_seen) {
        cal_diag(PSOC_EVT_CAL_STAGE_SAT_ALL, g_cal_async.stage_index);
        ok = 0u;
    }

    if (cal_measured_out_of_range(final_measured)) {
        /* No volver al default: si no hay punto perfecto, igual dejamos el
         * mejor candidato real encontrado y lo marcamos como no OK. */
        ok = 0u;

        if (g_cal_async.stage_index == (PSOC_CAL_STAGE_COUNT - 1u)) {
            /* La ultima etapa alimenta al canal de captura del ADC; avisar si
             * incluso el mejor candidato quedo fuera del rango operativo. */
            cal_diag(PSOC_EVT_CAL_LP_BAD, (uint8)g_cal_async.stage_index);
        }
    }

    final_dac = cal_stage_clamp_dac(stage, final_dac);
    stage->write(final_dac);
    result->final_dac = final_dac;
    result->final_measured = final_measured;
    result->ok = ok;
    if (!ok) {
        g_cal_async.ok = 0u;
    }
    cal_diag(PSOC_EVT_CAL_STAGE_DAC, result->final_dac);
    cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, result->final_measured);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, result->final_measured);
    cal_diag(PSOC_EVT_CAL_STAGE_OK, result->ok);

#if CAL_FAIL_FAST_ON_STAGE_FAIL
    if (!ok) {
        g_cal_async.stage_index = PSOC_CAL_STAGE_COUNT;
        g_cal_async.state = CAL_ASYNC_VERIFY_BEGIN;
        return;
    }
#endif

    g_cal_async.stage_index++;
    g_cal_async.state = CAL_ASYNC_STAGE_BEGIN;
}
#endif /* #if 0 -- biseccion legacy */

/* Compartido con cal_pi_finish_stage -- cierra la corrida de calibracion
 * (restaura AMux/captura, re-habilita isr_SyncIn) sin importar que
 * controlador la corrio. */
static void cal_async_complete(void)
{
    ADC_Stop();
    psoc_calibration_restore_capture_path();
    /* Restaura el FIR de adquisicion -- cal_pi_start() cargo el de
     * calibracion al empezar esta corrida; fuera de una calibracion el
     * Filter de hardware debe volver a tener el diseño de adquisicion. */
    (void)psoc_filter_load_fir_coefficients(g_fir_adquisition_coeffs_q23, FILTER_FIR_NTAPS);
#if defined(SYNC_IN_INTSTAT)
    (void)SYNC_IN_ClearInterrupt();
#endif
    isr_SyncIn_ClearPending();
    isr_SyncIn_Enable();
    g_cal_async.busy = 0u;
    g_cal_async.done = 1u;
    g_cal_async.state = CAL_ASYNC_DONE;
}

#if 0 /* biseccion legacy -- ver nota junto a cal_stage_saturated mas arriba */
static uint8 cal_async_realcheck_slope_increasing(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    if (g_cal_async.slope_known[g_cal_async.stage_index]) {
        return g_cal_async.slope_increasing[g_cal_async.stage_index];
    }
    return (stage->direction >= 0) ? 1u : 0u;
}

static void cal_async_finish_realcheck_stage(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    PsocCalResult *result = &g_psoc_cal_results[g_cal_async.stage_index];
    uint8 ok = (!g_cal_async.realcheck_current_saturated &&
                g_cal_async.realcheck_current_abs_error <=
                    cal_scale_counts(stage->realcheck.tol_counts)) ? 1u : 0u;

    g_cal_async.realcheck_current_dac =
        cal_stage_clamp_dac(stage, g_cal_async.realcheck_current_dac);
    stage->write(g_cal_async.realcheck_current_dac);
    result->final_dac = g_cal_async.realcheck_current_dac;
    result->final_measured = g_cal_async.realcheck_current_measured;
    result->ok = ok;
    if (!ok) {
        g_cal_async.ok = 0u;
    }
    cal_diag(PSOC_EVT_CAL_REALCHECK_OK, ok);
    g_cal_async.stage_index++;
    g_cal_async.state = CAL_ASYNC_REALCHECK_BEGIN;
}

