simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
static void cal_async_plan_realcheck_nudge(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    uint8 step = stage->realcheck.nudge_step;
    uint8 increasing;
    uint8 go_up;
    int16 next;
    int16 delta;

    if (!g_cal_async.realcheck_current_saturated &&
        g_cal_async.realcheck_current_abs_error <= cal_scale_counts(stage->realcheck.tol_counts)) {
        cal_async_finish_realcheck_stage();
        return;
    }
    if (g_cal_async.realcheck_nudge_count >= stage->realcheck.max_nudges ||
        step == 0u) {
        cal_async_finish_realcheck_stage();
        return;
    }

    increasing = cal_async_realcheck_slope_increasing();
    go_up = increasing
        ? ((g_cal_async.realcheck_current_measured < stage->target_counts) ? 1u : 0u)
        : ((g_cal_async.realcheck_current_measured > stage->target_counts) ? 1u : 0u);
    delta = go_up ? (int16)step : (int16)(-((int16)step));
    next = (int16)g_cal_async.realcheck_current_dac + delta;
    if (next < (int16)cal_stage_min_dac(stage)) {
        next = (int16)cal_stage_min_dac(stage);
    }
    if (next > (int16)cal_stage_max_dac(stage)) {
        next = (int16)cal_stage_max_dac(stage);
    }
    if ((uint8)next == g_cal_async.realcheck_current_dac) {
        cal_async_finish_realcheck_stage();
        return;
    }

    g_cal_async.realcheck_candidate_active = 1u;
    g_cal_async.realcheck_last_nudge = (int8)delta;
    g_cal_async.realcheck_nudge_count++;
    async_measure_begin((uint8)next, CAL_ASYNC_EVAL_REALCHECK,
                        &stage->realcheck.avg,
                        stage->realcheck.nudge_discard_samples,
                        1u, 1u);
}
#endif /* #if 0 -- biseccion legacy */

/* Aborta la calibracion por timeout (CAL_WATCHDOG_TICKS sin terminar).
 * Compartido con el PI (psoc_calibration_service_async la llama antes de
 * ramificar). Las etapas ya finalizadas (indices < stage_index) conservan su
 * mejor valor encontrado; la etapa en curso y las que faltan se fuerzan al
 * centro nominal de cada etapa. La condicion preserve_results es reliquia de
 * la biseccion (estados de verify/realcheck que el PI nunca setea) -- queda
 * inerte pero no rompe nada, no afecta el comportamiento. */
static void cal_async_abort_watchdog(void)
{
    uint8 i;
    uint8 preserve_results =
        (g_cal_async.state == CAL_ASYNC_VERIFY_BEGIN ||
         g_cal_async.state == CAL_ASYNC_EVAL_VERIFY ||
         g_cal_async.state == CAL_ASYNC_REALCHECK_SWITCH ||
         g_cal_async.state == CAL_ASYNC_REALCHECK_BEGIN ||
         g_cal_async.state == CAL_ASYNC_EVAL_REALCHECK) ? 1u : 0u;

    if (!preserve_results) {
        for (i = g_cal_async.stage_index; i < PSOC_CAL_STAGE_COUNT; i++) {
            uint8 center = cal_stage_center_dac(&g_psoc_cal_stages[i]);
            g_psoc_cal_stages[i].write(center);
            g_psoc_cal_results[i].final_dac = center;
            g_psoc_cal_results[i].final_measured = 0L;
            g_psoc_cal_results[i].ok = 0u;
        }
    }
    g_cal_async.ok = 0u;
    cal_diag(PSOC_EVT_CAL_WATCHDOG, g_cal_async.stage_index);

    cal_async_complete();
}

/* ============================================================
 * Controlador PI de calibracion: UNICO camino activo, GEO y HAMMER por igual
 * (la biseccion vieja quedo comentada con #if 0 mas arriba) — ver el bloque
 * "Controlador PI de calibracion" en calibration_tables.h para la ley de
 * control completa. Para diagnostico y robustez en banco usa la lectura
 * directa del ADC crudo (igual que el comando ADC snapshot): el camino
 * DMA/DFB/Filter queda disponible para adquisicion, pero no se usa como
 * fuente de calibracion porque en HAMMER con el capacitor de AMux conectado
 * puede quedar saturado/congelado y divergir respecto de la lectura directa.
 * Reutiliza g_cal_async.busy/done/ok/stage_index/start_ticks (watchdog) y
 * cal_async_complete/cal_async_abort_watchdog tal cual: para el resto del
 * firmware (EEPROM, diagnostico UART, ESP/web) esto es indistinguible de la
 * biseccion que reemplaza.
 * ============================================================ */

typedef enum {
    CAL_PI_STAGE_BEGIN = 0u,
    CAL_PI_RUN
} PsocCalPiState;

typedef struct {
    int32 kp_num;
    int32 kp_div;
    int32 ki_num;
    int32 ki_div;
    int32 lsb_counts;   /* cuentas ADC por 1 LSB de DAC -- detector de lock, ver calibration_tables.h */
    uint16 max_samples;
} PsocCalPiCfg;

typedef struct {
    PsocCalPiState state;
    int32 integral;
    int32 last_fir_output;
    int32 lock_buf[CAL_PI_LOCK_N];
    uint16 samples_taken;
    uint16 discard_samples; /* asentamiento de la etapa antes de cerrar el lazo */
    uint8 lock_idx;
    uint8 lock_count;
    uint8 dac_current;
    uint8 ema_valid;
    uint32 empty_polls;
} PsocCalPi;

static PsocCalPi g_cal_pi;

#if PSOC_HW_CLASS == PSOC_HW_GEO
static const PsocCalPiCfg g_cal_pi_cfg[PSOC_CAL_STAGE_COUNT] = {
    { CAL_PI_KP_NUM_GEO_PGA,   CAL_PI_KP_DIV_GEO_PGA,   CAL_PI_KI_NUM_GEO_PGA,   CAL_PI_KI_DIV_GEO_PGA,   CAL_PI_LSB_COUNTS_GEO_PGA,   CAL_PI_MAX_SAMPLES_GEO_PGA },
#if defined(VDAC_ref_BP_DEFAULT_DATA) || defined(CY_DVDAC_VDAC_ref_BP_H)
    { CAL_PI_KP_NUM_GEO_BP,    CAL_PI_KP_DIV_GEO_BP,    CAL_PI_KI_NUM_GEO_BP,    CAL_PI_KI_DIV_GEO_BP,    CAL_PI_LSB_COUNTS_GEO_BP,    CAL_PI_MAX_SAMPLES_GEO_BP },
#endif
    { CAL_PI_KP_NUM_GEO_ADDER, CAL_PI_KP_DIV_GEO_ADDER, CAL_PI_KI_NUM_GEO_ADDER, CAL_PI_KI_DIV_GEO_ADDER, CAL_PI_LSB_COUNTS_GEO_ADDER, CAL_PI_MAX_SAMPLES_GEO_ADDER },
    { CAL_PI_KP_NUM_GEO_LP,    CAL_PI_KP_DIV_GEO_LP,    CAL_PI_KI_NUM_GEO_LP,    CAL_PI_KI_DIV_GEO_LP,    CAL_PI_LSB_COUNTS_GEO_LP,    CAL_PI_MAX_SAMPLES_GEO_LP },
};
#else
static const PsocCalPiCfg g_cal_pi_cfg[PSOC_CAL_STAGE_COUNT] = {
    { CAL_PI_KP_NUM_HAMMER_PGA, CAL_PI_KP_DIV_HAMMER_PGA, CAL_PI_KI_NUM_HAMMER_PGA, CAL_PI_KI_DIV_HAMMER_PGA, CAL_PI_LSB_COUNTS_HAMMER_PGA, CAL_PI_MAX_SAMPLES_HAMMER_PGA },
    { CAL_PI_KP_NUM_HAMMER_LP,  CAL_PI_KP_DIV_HAMMER_LP,  CAL_PI_KI_NUM_HAMMER_LP,  CAL_PI_KI_DIV_HAMMER_LP,  CAL_PI_LSB_COUNTS_HAMMER_LP,  CAL_PI_MAX_SAMPLES_HAMMER_LP },
};
#endif

static uint8 cal_pi_refine_final_dac(const PsocCalStage *stage, uint8 seed_dac,
                                     int32 *out_measured)
{
    uint8 stage_lo = cal_stage_min_dac(stage);
    uint8 stage_hi = cal_stage_max_dac(stage);
    uint8 radius = (uint8)CAL_PI_FINAL_REFINE_RADIUS;
    uint8 lo = (seed_dac > radius) ? (uint8)(seed_dac - radius) : 0u;
    uint16 hi16 = (uint16)seed_dac + (uint16)radius;
    uint8 hi = (hi16 > 255u) ? 255u : (uint8)hi16;
    uint8 dac;
    uint8 best_dac = seed_dac;
    int32 best_measured = 0L;
    int32 best_abs_error = 0x7FFFFFFFL;

    if (lo < stage_lo) { lo = stage_lo; }
    if (hi > stage_hi) { hi = stage_hi; }

    for (dac = lo; ; dac++) {
        int32 measured;
        int32 control;
        int32 error;
        int32 abs_error;

        stage->write(dac);
        CyDelay(CAL_PI_FINAL_REFINE_SETTLE_MS);
        measured = cal_adc_read_direct_avg_counts(CAL_PI_FINAL_REFINE_SAMPLES);
        control = cal_pi_compare_counts(measured);
        error = stage->target_counts - control;
        abs_error = abs_counts(error);

        if (abs_error < best_abs_error) {
            best_abs_error = abs_error;
            best_measured = measured;
            best_dac = dac;
        }

        if (dac >= hi) {
            break;
        }
    }

    stage->write(best_dac);
    CyDelay(CAL_PI_FINAL_VERIFY_SETTLE_MS);
    best_measured = cal_adc_read_direct_avg_counts(CAL_PI_FINAL_VERIFY_SAMPLES);
    if (out_measured != (int32 *)0) {
        *out_measured = best_measured;
    }
    return best_dac;
}

