simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
static uint8 cal_pi_finish_stage(uint8 ok)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    PsocCalResult *result = &g_psoc_cal_results[g_cal_async.stage_index];
    int32 verify_measured;
    int32 verify_control;
    int32 verify_error;
    uint8 verify_ok;
    uint8 final_pass;

    g_cal_pi.dac_current =
        cal_pi_refine_final_dac(stage, g_cal_pi.dac_current, &verify_measured);
    verify_control = cal_pi_compare_counts(verify_measured);
    verify_error = stage->target_counts - verify_control;
    verify_ok = (abs_counts(verify_error) <= stage->tolerance_counts) ? 1u : 0u;

    if (ok && !verify_ok && g_cal_pi.samples_taken < cfg->max_samples) {
        g_cal_pi.lock_idx = 0u;
        g_cal_pi.lock_count = 0u;
        g_cal_pi.integral = 0L;
        g_cal_pi.last_fir_output = verify_measured;
        return 0u;
    }

    ok = verify_ok;
    final_pass = ((uint8)(g_cal_async.pass_index + 1u) >= (uint8)CAL_PI_PASS_COUNT) ? 1u : 0u;

    result->final_dac = g_cal_pi.dac_current;
    result->final_measured = verify_measured;
    result->ok = ok;
    g_cal_pi.last_fir_output = verify_measured;
    if (!ok && final_pass) {
        g_cal_async.ok = 0u;
    }

    cal_diag(PSOC_EVT_CAL_STAGE_DAC, result->final_dac);
    cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, result->final_measured);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, result->final_measured);
    cal_diag(PSOC_EVT_CAL_STAGE_OK, result->ok);

    g_cal_async.stage_index++;
    if (g_cal_async.stage_index >= PSOC_CAL_STAGE_COUNT) {
        if (!final_pass) {
            g_cal_async.pass_index++;
            g_cal_async.stage_index = 0u;
            g_cal_pi.state = CAL_PI_STAGE_BEGIN;
            return 0u;
        }
        cal_async_complete();
        return 1u;
    }
    g_cal_pi.state = CAL_PI_STAGE_BEGIN;
    return 0u;
}

static void cal_pi_stage_begin(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];

    cal_diag(PSOC_EVT_CAL_STAGE_BEGIN, g_cal_async.stage_index);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_TARGET32, stage->target_counts);

    g_cal_pi.integral = 0L;
    g_cal_pi.samples_taken = 0u;
    g_cal_pi.lock_idx = 0u;
    g_cal_pi.lock_count = 0u;
    g_cal_pi.last_fir_output = 0L;
    g_cal_pi.ema_valid = 0u;
    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.dac_current = cal_stage_current_dac(g_cal_async.stage_index);
    stage->write(g_cal_pi.dac_current);

    /* Descarte tras cambiar AMux/DAC: solo asentamiento analogico. */
    g_cal_pi.discard_samples = stage->settle_samples;

    ADC_Stop();
    CAL_AMUX_ADC_SELECT(stage->adc_channel);
    ADC_Start();

#if CAL_DIAG_SWEEP_ENABLE
    cal_diag_sweep_stage(stage);
#endif

    stage->write(g_cal_pi.dac_current);
    ADC_StopConvert();

    g_cal_pi.state = CAL_PI_RUN;
}

static uint8 cal_pi_run_service(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    int32 sample;
    int32 control_sample;
    int32 error;
    int32 effort;
    uint16 sample_index;
    uint16 limited_dac;
    uint8 dac_sample;
    uint8 dac_lo;
    uint8 dac_hi;
    uint8 dac_desired;
    uint8 dac_target;
    uint8 can_integrate;
    uint8 max_step;
    uint8 i;

    sample = cal_adc_read_direct_counts();
    g_cal_pi.empty_polls = 0UL;

    if (g_cal_pi.discard_samples > 0u) {
        g_cal_pi.discard_samples--;
        return 0u;
    }

    /* ADC crudo directo, suavizado en firmware para no decidir lock/ok con
     * una muestra instantanea ruidosa. */
    if (!g_cal_pi.ema_valid) {
        g_cal_pi.last_fir_output = sample;
        g_cal_pi.ema_valid = 1u;
    } else {
#if (CAL_PI_DIRECT_EMA_SHIFT == 0u)
        g_cal_pi.last_fir_output = sample;
#else
        int32 delta = sample - g_cal_pi.last_fir_output;
        int32 half = (int32)1L << (CAL_PI_DIRECT_EMA_SHIFT - 1u);
        if (delta >= 0L) {
            g_cal_pi.last_fir_output += (delta + half) >> CAL_PI_DIRECT_EMA_SHIFT;
        } else {
            g_cal_pi.last_fir_output -= ((-delta) + half) >> CAL_PI_DIRECT_EMA_SHIFT;
        }
#endif
    }
    control_sample = cal_pi_compare_counts(g_cal_pi.last_fir_output);
    error = stage->target_counts - control_sample;
    dac_sample = g_cal_pi.dac_current;

    /* stage->direction: sentido VDAC->medida asumido (ver comentario junto a
     * CAL_DIRECTION_HAMMER_PGA/CAL_DIRECTION_GEO_PGA en calibration_tables.h).
     * La accion es incremental sobre el DAC actual: si el error ya quedo
     * cerca de cero, el lazo conserva el punto encontrado en vez de volver al
     * feedforward/centro nominal de la etapa. */
    effort = (int32)g_cal_pi.dac_current
           + (int32)stage->direction *
             ( (error * cfg->kp_num) / ((cfg->kp_div == 0L) ? 1L : cfg->kp_div)
             + (g_cal_pi.integral * cfg->ki_num) / ((cfg->ki_div == 0L) ? 1L : cfg->ki_div) );

    dac_lo = cal_stage_min_dac(stage);
    dac_hi = cal_stage_max_dac(stage);
    can_integrate = 0u;

    if (effort < (int32)dac_lo) {
        dac_desired = dac_lo;
    } else if (effort > (int32)dac_hi) {
        dac_desired = dac_hi;
    } else {
        dac_desired = (uint8)effort;
        can_integrate = 1u;
    }

    max_step = (CAL_PI_MAX_DAC_STEP == 0u) ? 1u : (uint8)CAL_PI_MAX_DAC_STEP;
    if (dac_desired > g_cal_pi.dac_current) {
        limited_dac = (uint16)g_cal_pi.dac_current + (uint16)max_step;
        dac_target = ((uint16)dac_desired < limited_dac) ? dac_desired : (uint8)limited_dac;
    } else if (dac_desired < g_cal_pi.dac_current) {
        limited_dac = ((uint16)g_cal_pi.dac_current > (uint16)max_step)
            ? ((uint16)g_cal_pi.dac_current - (uint16)max_step)
            : 0u;
        dac_target = ((uint16)dac_desired > limited_dac) ? dac_desired : (uint8)limited_dac;
    } else {
        dac_target = dac_desired;
    }

    /* anti-windup: solo integra si no hubo saturacion ni rate-limit. */
    if (can_integrate && dac_target == dac_desired) {
        g_cal_pi.integral = cal_servo_clip_integral(g_cal_pi.integral + error);
    }

    sample_index = (uint16)(g_cal_pi.samples_taken + 1u);
    g_cal_pi.samples_taken = sample_index;
    if (sample_index == 1u || (sample_index % CAL_PI_TELEM_PERIOD) == 0u) {
        cal_diag(PSOC_EVT_CAL_STAGE_DAC, dac_sample);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, g_cal_pi.last_fir_output);
    }

