simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    g_cal_pi.dac_current = dac_target;
    stage->write(g_cal_pi.dac_current);

    /* Detector de lock (puerto de detect_lock(err,lsb,N,reset), ver
     * comentario junto a CAL_PI_LOCK_N en calibration_tables.h): ventana
     * deslizante de fir_output: lockea cuando su span (max-min) cae dentro
     * de ~1.1 LSB de DAC expresado en counts ADC. Lockear cierra la etapa
     * de una — no hace falta des-lock porque la cascada nunca se queda
     * dando vueltas en ese estado. */
    g_cal_pi.lock_buf[g_cal_pi.lock_idx] = control_sample;
    g_cal_pi.lock_idx++;
    if (g_cal_pi.lock_idx >= CAL_PI_LOCK_N) {
        g_cal_pi.lock_idx = 0u;
    }
    if (g_cal_pi.lock_count < CAL_PI_LOCK_N) {
        g_cal_pi.lock_count++;
    }

    if (g_cal_pi.lock_count >= CAL_PI_LOCK_N) {
        int32 span_lo = g_cal_pi.lock_buf[0];
        int32 span_hi = g_cal_pi.lock_buf[0];
        int32 one_lsb_counts = (cfg->lsb_counts <= 0L) ? 1L : cfg->lsb_counts;

        for (i = 1u; i < CAL_PI_LOCK_N; i++) {
            if (g_cal_pi.lock_buf[i] < span_lo) { span_lo = g_cal_pi.lock_buf[i]; }
            if (g_cal_pi.lock_buf[i] > span_hi) { span_hi = g_cal_pi.lock_buf[i]; }
        }

        if ((span_hi - span_lo) <= (one_lsb_counts + one_lsb_counts / 10L) &&
            abs_counts(error) <= stage->tolerance_counts) {
            return cal_pi_finish_stage(1u);
        }
    }

    if (g_cal_pi.samples_taken >= cfg->max_samples) {
        return cal_pi_finish_stage((abs_counts(error) <= stage->tolerance_counts) ? 1u : 0u);
    }

    return 0u;
}

static void cal_pi_start(void)
{
    /* Carga el FIR pensado para calibracion (suavizado, distinto del de
     * adquisicion) en el Filter de hardware -- se restaura el de
     * adquisicion en cal_async_complete() al cerrar la corrida. */
    (void)psoc_filter_load_fir_coefficients(g_fir_calibration_coeffs_q23, FILTER_FIR_NTAPS);
    g_cal_pi.state = CAL_PI_STAGE_BEGIN;
}

static uint8 cal_pi_service(void)
{
    switch (g_cal_pi.state) {
        case CAL_PI_STAGE_BEGIN:
            cal_pi_stage_begin();
            return 0u;
        case CAL_PI_RUN:
            return cal_pi_run_service();
        default:
            return 0u;
    }
}

uint8 psoc_calibration_start_async(void)
{
    uint8 i;

    if (g_cal_async.busy) {
        return 0u;
    }

    isr_SyncIn_Disable();
    ADC_Stop();
    psoc_adc_select_capture_config();
    ADC_Stop();

    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
    g_cal_async.busy = 1u;
    g_cal_async.done = 0u;
    g_cal_async.ok = 1u;
    g_cal_async.stage_index = 0u;
    g_cal_async.pass_index = 0u;
    g_cal_async.start_ticks = psoc_now_ticks();
    g_cal_async.last_progress_ticks = g_cal_async.start_ticks;
    for (i = 0u; i < PSOC_CAL_MAX_STAGES; i++) {
        g_cal_async.slope_known[i] = 0u;
        g_cal_async.slope_increasing[i] = 0u;
    }
    cal_pi_start();   /* unico camino de calibracion, GEO y HAMMER por igual */
    return 1u;
}

uint8 psoc_calibration_async_busy(void)
{
    return g_cal_async.busy;
}

uint8 psoc_calibration_async_result_ok(void)
{
    return g_cal_async.ok;
}

#if 0 /* biseccion legacy -- el chequeo de rango operativo de GEO_LP que
       * hacia esta funcion (cal_measured_out_of_range) quedo sin uso junto
       * con la biseccion; psoc_calibration_async_result_ok() de arriba ya
       * no lo necesita. */
static uint8 psoc_calibration_async_result_ok_geo_legacy(void)
{
    if (g_psoc_cal_result_count >= PSOC_CAL_STAGE_COUNT) {
        return cal_measured_out_of_range(
            g_psoc_cal_results[PSOC_CAL_STAGE_COUNT - 1u].final_measured
        ) ? 0u : 1u;
    }
    return g_cal_async.ok;
}
#endif /* #if 0 -- biseccion legacy */

uint8 psoc_calibration_service_async(void)
{
    if (!g_cal_async.busy) {
        return 0u;
    }

    {
        uint32 now = psoc_now_ticks();
        if ((now - g_cal_async.start_ticks) >= CAL_WATCHDOG_TICKS) {
            cal_async_abort_watchdog();
            return 1u;
        }
        if ((now - g_cal_async.last_progress_ticks) >= CAL_PROGRESS_PERIOD_TICKS) {
            g_cal_async.last_progress_ticks = now;
            cal_diag(PSOC_EVT_CAL_PROGRESS, g_cal_async.stage_index);
        }
    }

    return cal_pi_service();   /* unico camino de calibracion */
}

#if 0 /* biseccion legacy -- ver nota junto a cal_stage_saturated mas arriba.
       * Este era el cuerpo real de psoc_calibration_service_async() para
       * GEO antes de unificar todo en el PI. */
static uint8 psoc_calibration_service_async_geo_legacy(void)
{
    {
    const PsocCalStage *stage;
    int32 abs_error;

    switch (g_cal_async.state) {
        case CAL_ASYNC_STAGE_BEGIN:
            if (g_cal_async.stage_index >= PSOC_CAL_STAGE_COUNT) {
                g_cal_async.stage_index = 0u;
                g_cal_async.state = CAL_ASYNC_VERIFY_BEGIN;
                break;
            }
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            cal_async_reset_stage_memory();
            cal_diag(PSOC_EVT_CAL_STAGE_BEGIN, g_cal_async.stage_index);
            ADC_Stop();
            CAL_AMUX_ADC_SELECT_STAGE(stage->adc_channel);
            ADC_Start();
            isr_DMA_DelSig_RAM_ClearPending();
            ADC_StartConvert();
            async_measure_begin(cal_stage_center_dac(stage), CAL_ASYNC_EVAL_INIT,
                                &stage->avg, stage->settle_samples, 1u, 0u);
            break;

        case CAL_ASYNC_MEASURE:
            (void)async_measure_service();
            break;

        case CAL_ASYNC_EVAL_INIT:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            g_cal_async.base_measured = g_cal_async.measured;
            (void)cal_async_record_measurement(stage);
            if (g_cal_async.best_abs_error <= cal_scale_counts(stage->tolerance_counts)) {
                async_finish_stage(1u);
                break;
            }
            g_cal_async.dac = cal_stage_probe_dac(stage);
            if (g_cal_async.dac == g_cal_async.best_dac) {
                async_finish_stage(0u);
                break;
            }
            async_measure_begin(g_cal_async.dac, CAL_ASYNC_EVAL_PROBE,
                                &stage->avg, stage->settle_samples, 1u, 0u);
            break;

