simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
        case CAL_ASYNC_EVAL_PROBE:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            if (cal_async_record_measurement(stage)) {
                cal_diag(PSOC_EVT_CAL_LOOP, g_cal_async.dac);
                async_finish_stage((g_cal_async.best_abs_error <= cal_scale_counts(stage->tolerance_counts)) ? 1u : 0u);
                break;
            }
            if (g_cal_async.best_abs_error <= cal_scale_counts(stage->tolerance_counts)) {
                async_finish_stage(1u);
                break;
            }
            if (cal_scale_counts(g_cal_async.measured) == cal_scale_counts(g_cal_async.base_measured)) {
                g_cal_async.increasing = (stage->direction >= 0) ? 1u : 0u;
            } else {
                g_cal_async.increasing =
                    ((cal_scale_counts(g_cal_async.measured) > cal_scale_counts(g_cal_async.base_measured)) ==
                     (g_cal_async.dac > cal_stage_center_dac(stage))) ? 1u : 0u;
            }
            g_cal_async.slope_known[g_cal_async.stage_index] = 1u;
            g_cal_async.slope_increasing[g_cal_async.stage_index] =
                g_cal_async.increasing;
            g_cal_async.lo = cal_stage_min_dac(stage);
            g_cal_async.hi = cal_stage_max_dac(stage);
            g_cal_async.iter = 0u;
            g_cal_async.state = CAL_ASYNC_PLAN_ITER;
            break;

        case CAL_ASYNC_PLAN_ITER:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            if (g_cal_async.iter >= stage->max_iter) {
                async_finish_stage(0u);
                break;
            }
            {
                int32 cur_error = abs_counts(cal_scale_counts(stage->target_counts) -
                                              cal_scale_counts(g_cal_async.measured));
                uint8 go_up;
                uint8 next_dac;

                if (cur_error <= cal_scale_counts(stage->deadband_counts)) {
                    async_finish_stage(1u);
                    break;
                }

                go_up = g_cal_async.increasing
                    ? ((cal_scale_counts(g_cal_async.measured) < cal_scale_counts(stage->target_counts)) ? 1u : 0u)
                    : ((cal_scale_counts(g_cal_async.measured) > cal_scale_counts(stage->target_counts)) ? 1u : 0u);

                if (go_up) {
                    if (g_cal_async.dac >= cal_stage_max_dac(stage)) {
                        async_finish_stage(0u);
                        break;
                    }
                    g_cal_async.lo = (uint8)(g_cal_async.dac + 1u);
                } else {
                    if (g_cal_async.dac <= cal_stage_min_dac(stage)) {
                        async_finish_stage(0u);
                        break;
                    }
                    g_cal_async.hi = (uint8)(g_cal_async.dac - 1u);
                }
                if (g_cal_async.lo > g_cal_async.hi) {
                    async_finish_stage(0u);
                    break;
                }
                next_dac = (uint8)(g_cal_async.lo + ((g_cal_async.hi - g_cal_async.lo) / 2u));
                next_dac = cal_stage_clamp_dac(stage, next_dac);
                if (next_dac == g_cal_async.dac) {
                    async_finish_stage(0u);
                    break;
                }
                g_cal_async.iter++;
                async_measure_begin(next_dac, CAL_ASYNC_EVAL_ITER,
                                    &stage->avg, stage->settle_samples, 1u, 0u);
            }
            break;

        case CAL_ASYNC_EVAL_ITER:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            if (cal_async_record_measurement(stage)) {
                cal_diag(PSOC_EVT_CAL_LOOP, g_cal_async.dac);
                async_finish_stage((g_cal_async.best_abs_error <= cal_scale_counts(stage->tolerance_counts)) ? 1u : 0u);
                break;
            }
            if (g_cal_async.best_abs_error <= cal_scale_counts(stage->tolerance_counts)) {
                async_finish_stage(1u);
            } else {
                g_cal_async.state = CAL_ASYNC_PLAN_ITER;
            }
            break;

        case CAL_ASYNC_VERIFY_BEGIN:
            if (g_cal_async.stage_index >= PSOC_CAL_STAGE_COUNT) {
                g_cal_async.state = CAL_ASYNC_REALCHECK_SWITCH;
                break;
            }
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            cal_diag(PSOC_EVT_CAL_VERIFY_BEGIN, g_cal_async.stage_index);
            ADC_Stop();
            CAL_AMUX_ADC_SELECT_STAGE(stage->adc_channel);
            ADC_Start();
            isr_DMA_DelSig_RAM_ClearPending();
            ADC_StartConvert();
            async_measure_begin(g_psoc_cal_results[g_cal_async.stage_index].final_dac,
                                CAL_ASYNC_EVAL_VERIFY,
                                &stage->verify_avg,
                                stage->verify_settle_samples,
                                0u, 0u);
            break;

        case CAL_ASYNC_EVAL_VERIFY:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            {
                PsocCalResult *result = &g_psoc_cal_results[g_cal_async.stage_index];
                uint8 verify_ok;
                uint8 saturated;

                result->final_measured = g_cal_async.measured;
                abs_error = abs_counts(cal_scale_counts(stage->target_counts) -
                                        cal_scale_counts(g_cal_async.measured));
                saturated = cal_stage_saturated(stage, g_cal_async.measured);
                cal_diag(PSOC_EVT_CAL_STAGE_SAT, saturated);
                verify_ok = (!saturated && abs_error <= cal_scale_counts(stage->tolerance_counts)) ? 1u : 0u;
                result->ok = (uint8)(result->ok && verify_ok);
                if (!verify_ok) {
                    g_cal_async.ok = 0u;
                }
                cal_diag(PSOC_EVT_CAL_VERIFY_OK, verify_ok);
                g_cal_async.stage_index++;
                g_cal_async.state = CAL_ASYNC_VERIFY_BEGIN;
            }
            break;

        case CAL_ASYNC_REALCHECK_SWITCH:
            ADC_Stop();
            g_cal_async.stage_index = 0u;
            g_cal_async.state = CAL_ASYNC_REALCHECK_BEGIN;
            break;

        case CAL_ASYNC_REALCHECK_BEGIN:
            if (g_cal_async.stage_index >= PSOC_CAL_STAGE_COUNT) {
                cal_async_complete();
                return 1u;
            }
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            if (!stage->realcheck.enable) {
                g_cal_async.stage_index++;
                break;
            }
            g_cal_async.realcheck_candidate_active = 0u;
            g_cal_async.realcheck_nudge_count = 0u;
            g_cal_async.realcheck_current_dac =
                g_psoc_cal_results[g_cal_async.stage_index].final_dac;
            g_cal_async.realcheck_current_dac =
                cal_stage_clamp_dac(stage, g_cal_async.realcheck_current_dac);
            g_cal_async.realcheck_current_measured =
                g_psoc_cal_results[g_cal_async.stage_index].final_measured;
            g_cal_async.realcheck_current_abs_error = 0x7FFFFFFFL;
            g_cal_async.realcheck_current_saturated = 0u;
            g_cal_async.realcheck_last_nudge = 0;
            stage->write(g_cal_async.realcheck_current_dac);
            cal_diag(PSOC_EVT_CAL_REALCHECK_BEGIN, g_cal_async.stage_index);
            ADC_Stop();
            CAL_AMUX_ADC_SELECT_STAGE(stage->adc_channel);
            ADC_Start();
            isr_DMA_DelSig_RAM_ClearPending();
            ADC_StartConvert();
            async_measure_begin(g_cal_async.realcheck_current_dac,
                                CAL_ASYNC_EVAL_REALCHECK,
                                &stage->realcheck.avg,
                                stage->realcheck.discard_samples,
                                0u, 1u);
            break;

        case CAL_ASYNC_EVAL_REALCHECK:
            stage = &g_psoc_cal_stages[g_cal_async.stage_index];
            {
                uint8 saturated =
                    cal_stage_saturated(stage, g_cal_async.measured);
                int32 real_abs_error =
                    abs_counts(cal_scale_counts(stage->target_counts) -
                               cal_scale_counts(g_cal_async.measured));

                cal_diag(PSOC_EVT_CAL_STAGE_SAT, saturated);
                if (g_cal_async.realcheck_candidate_active) {
                    if (saturated ||
                        (!g_cal_async.realcheck_current_saturated &&
                         real_abs_error >= g_cal_async.realcheck_current_abs_error)) {
                        stage->write(g_cal_async.realcheck_current_dac);
                        cal_diag(PSOC_EVT_CAL_REALCHECK_NUDGE, 0u);
                        g_cal_async.realcheck_candidate_active = 0u;
                        cal_async_finish_realcheck_stage();
                    } else {
                        g_cal_async.realcheck_current_dac = g_cal_async.dac;
                        g_cal_async.realcheck_current_measured =
                            g_cal_async.measured;
                        g_cal_async.realcheck_current_abs_error =
                            real_abs_error;
                        g_cal_async.realcheck_current_saturated = saturated;
                        cal_diag(PSOC_EVT_CAL_REALCHECK_NUDGE,
                                 (uint8)g_cal_async.realcheck_last_nudge);
                        g_cal_async.realcheck_candidate_active = 0u;
                        cal_async_plan_realcheck_nudge();
                    }
                } else {
                    g_cal_async.realcheck_current_dac = g_cal_async.dac;
                    g_cal_async.realcheck_current_measured = g_cal_async.measured;
                    g_cal_async.realcheck_current_abs_error = real_abs_error;
                    g_cal_async.realcheck_current_saturated = saturated;
                    cal_async_plan_realcheck_nudge();
                }
            }
            break;

        default:
            break;
    }
    }

    return 0u;
}
#endif /* #if 0 -- biseccion legacy */
